jhkim0712/WT32/sdkconfig.defaults
# WT32-SC01 Plus firmware - default sdkconfig
# These defaults are applied on a clean `idf.py set-target esp32s3` / first build.
# Run `idf.py menuconfig` to review/tune after the first build.

#
# ESP32-S3 / flash / PSRAM
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# WT32-S3-WROVER modules carry octal/quad PSRAM - enable it and let the app use it for
# LVGL buffers, JPEG decode scratch space and the HTTP server.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# The default main task stack is too small once LVGL + httpd + wifi are all touched
# from app_main().
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

#
# OTA updates (components/app_ota)
#
# Auto-rollback safety net: a newly flashed image must reach
# app_ota_confirm_boot() (called at the end of app_main(), after the UI is
# up) or the bootloader reverts to the previous working image on next boot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# Needed to verify github.com/api.github.com's TLS certificate when checking
# for/downloading updates, without pinning a specific CA that can expire.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

#
# Wi-Fi / networking
#
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_MDNS_MAX_SERVICES=4

#
# FATFS (SD card)
#
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_CODEPAGE_DYNAMIC=y

#
# LVGL (component config -> LVGL)
#
CONFIG_LV_COLOR_DEPTH_16=y
# Byte swapping is handled per-display by esp_lvgl_port's `.flags.swap_bytes`
# (see bsp_display.c) - LVGL v9 has no global LV_COLOR_16_SWAP option
# anymore, so don't re-add one here (it would double-swap the bytes).
CONFIG_LV_USE_LOG=y
CONFIG_LV_USE_CLIB_MALLOC=y # use malloc/free (can draw from PSRAM) instead of LVGL's small built-in pool
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_16=y
# lv_font_conv compresses glyph bitmaps by default (see font_clock_80.c,
# font_weather_icons_64.c) - needs this to actually decode them at draw
# time, or the glyphs silently draw as nothing (label just looks empty).
CONFIG_LV_USE_FONT_COMPRESSED=y
# Renders the SoftAP QR code on the first-time setup screen (ui_setup.c).
CONFIG_LV_USE_QRCODE=y
# Animated GIFs in the photo album (ui_album.c), read straight off the SD
# card. lv_gif opens files through LVGL's own filesystem layer, not plain
# fopen(), so it needs a driver registered - the built-in POSIX one, on
# drive letter "S:", with an empty root so "S:/sdcard/..." maps directly
# onto the real "/sdcard/..." VFS path (same paths app_photo already uses).
CONFIG_LV_USE_GIF=y
CONFIG_LV_USE_FS_POSIX=y
# 83 = ASCII 'S' - Kconfig's LV_FS_POSIX_LETTER is an int, not a char.
CONFIG_LV_FS_POSIX_LETTER=83
CONFIG_LV_FS_POSIX_PATH=""

#
# Logging
#
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
